# DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
l = [1,2,3,4,5,6]

In [3]:
l

[1, 2, 3, 4, 5, 6]

In [4]:
pd.DataFrame(l)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
pd.DataFrame(l, columns = ["variable_name"])

   variable_name
0              1
1              2
2              3
3              4
4              5
5              6

In [10]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [17]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [26]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [28]:
df.columns = ("var4","var5","var6")

In [29]:
df

   var4  var5  var6
0     1     2     3
1     4     5     6
2     7     8     9

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var4', 'var5', 'var6'], dtype='object')]

In [34]:
df.ndim

2

In [35]:
df.size

9

In [36]:
df.shape

(3, 3)

In [37]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
type(df.values)

numpy.ndarray

In [39]:
df.tail(1)

   var4  var5  var6
2     7     8     9

In [40]:
a = np.array([1,2,3,4,5])

In [42]:
pd.DataFrame(a,columns = ["var1"])

   var1
0     1
1     2
2     3
3     4
4     5

In [2]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [4]:
df.dtypes # this is dtype in serie and numpy array

method             object
number              int64
orbital_period    float64
mass              float64
distance          float64
year                int64
dtype: object

In [5]:
df.ndim

2

In [9]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [11]:
df.values

array([['Radial Velocity', 1, 269.3, 7.1, 77.4, 2006],
       ['Radial Velocity', 1, 874.774, 2.21, 56.95, 2008],
       ['Radial Velocity', 1, 763.0, 2.6, 19.84, 2011],
       ...,
       ['Transit', 1, 3.1915239, nan, 174.0, 2007],
       ['Transit', 1, 4.1250828, nan, 293.0, 2008],
       ['Transit', 1, 4.187757, nan, 260.0, 2008]], dtype=object)

In [12]:
df.index

RangeIndex(start=0, stop=1035, step=1)

In [13]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [ ]:
df[0] # it gives an error

In [30]:
df.loc[0] # it gives the line by the own index

method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [23]:
df.iloc[-1]  # it gives the line by general index, even if the first index "test" we can access 0 with iloc

method             Transit
number                   1
orbital_period    4.187757
mass                   NaN
distance             260.0
year                  2008
Name: 1034, dtype: object

In [27]:
df["mass"].head() # it gives the column

0     7.10
1     2.21
2     2.60
3    19.40
4    10.50
Name: mass, dtype: float64

In [31]:
df.loc[0]["mass"]

7.1

In [32]:
df.loc[0,"mass"]

7.1

In [34]:
df.loc[0:3,"mass"]

0     7.10
1     2.21
2     2.60
3    19.40
Name: mass, dtype: float64

In [36]:
df.loc[0:3,["mass","year"]]

    mass  year
0   7.10  2006
1   2.21  2008
2   2.60  2011
3  19.40  2007